package com.way2mars.ij.java.checkfirms;

import java.util.ArrayList;

public final class QueryUtils {
    public static ArrayList<FirmData> createFakeList() {
        ArrayList<FirmData> firmList = new ArrayList<>();

        firmList.add(new FirmData("АО Газпром", "2464010203", "2022-12-24",
                "Бла-бла-бла 1234567890", "2023-01-01", "По решению суда в случае допущенных при его создании грубых нарушений закона, если эти нарушения носят неустранимый характер, либо в случае осуществления деятельности без надлежащего разрешения (лицензии) либо деятельности, запрещенной законом"));
        firmList.add(new FirmData("ПАО Билайн", "2464010203", "2022-11-24", "Бла-бла-бла 1234567890"));
        firmList.add(new FirmData("ЗАО АлиЭкспресс", "2464010203", "2022-10-24", "Бла-бла-бла 1234567890"));
        firmList.add(new FirmData("АО РЖД", "2464010203", "2022-12-20", "Бла-бла-бла 1234567890"));
        firmList.add(new FirmData("ООО Трава у Дома", "2464010203", "2020-10-20",
                "Бла-бла-бла 1234567890", "2023-01-03", "The grass is green"));
        firmList.add(new FirmData("ООО Пивчанский", "2464010203", "2017-01-12", "Бла-бла-бла 1234567890"));
        firmList.add(new FirmData("ООО СевСнабТяжМясНИИ", "2464010203", "2021-05-09", "Бла-бла-бла 1234567890"));
        firmList.add(new FirmData("ООО Наша пряжа", "2464090807", "2021-07-19", "Бла-бла-бла какой-то иной текст для создания разнообразного разнообразия разнообразных вариантов написания бессмысленного текста"));


        return firmList;
    }
}
